googledrive-connector-test/src/test/resources/artifacts/ESB/config/soapRequests/googledrive/getCommentByID.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:wso2.connector.googledrive.getCommentByID">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:fileId>1o4qUs1CTQp3Ay9CLjAy2YNnSpCwbek3rK8toiAdAze0</urn:fileId>
      <urn:useServiceAccount>true</urn:useServiceAccount>
      <urn:clientId>757865184057-arrqda3cibnpr80sf4emf6i2b0sn7ln7.apps.googleusercontent.com</urn:clientId>
      <urn:clientSecret>9Hi25yrITA2akojpYuIcSm0k</urn:clientSecret>
      <urn:accessToken>ya29.1.AADtN_VG3dKNkzAVZHvBuX3BQLAu5bCrSAVxxw93arDC5WT86XtzyRCHQ7pm0J37VVMchHYZ</urn:accessToken>
      <urn:refreshToken>1/RdPNXMAOeqpLYPe2p9lNReHGK-DA6fpaBEPKz6FkuOc</urn:refreshToken>
      <urn:serviceAccountEmail>757865184057-nv5f3absgstcnd94tldenra586rfnhne@developer.gserviceaccount.com</urn:serviceAccountEmail>
      <urn:serviceAccountPKCSContent>MIIGwAIBAzCCBnoGCSqGSIb3DQEHAaCCBmsEggZnMIIGYzCCAygGCSqGSIb3DQEHAaCCAxkEggMV
MIIDETCCAw0GCyqGSIb3DQEMCgECoIICsjCCAq4wKAYKKoZIhvcNAQwBAzAaBBS3Dh+zWOSrWiFN
yisSowKJkcP9hgICBAAEggKAYSaESskST+To5siV5Pt96XxiH1AaMQFVMvSsoycW/vxq/A57EtJm
1qWEWH3wx+s2OoOs2X1Sy5jAXCSsxcNIjSiW9jHB2TykdJHWxZhKusLxmOD+IZFL2qRP61pQHxj3
Va3t9l9ry4AUsLINh0iDft0qpbgdEdXNWyhGnPrWY7Dp8O1H+GSC28rPFUoH2wZVbU2xhuRXYasn
lxmy32Bx17L9+b5AgUbDksexd/Fl1Mul9QFYVGb4e2msjPlXP0o19h6wGbw2BkUbVzHOz+aTZRmu
qv0cIRWz4876jqH1DC86dWB+N3SjWszC7Tji+yPdYNjsE2tXn3vYdpvafMbFZwa0cQwgdgLnnAC1
7wOvAK5z2HNSIa9md7zmeuj5BzuzCsSjXtt8W6RzbPbWlKJX1lMZr7jysFSDJ6yO3OkLDeZrgMA/
M/GhgyRyKWl+YHOwlpjZmGr17eFRpYly2+pG+RsoGfJjyzOPWIS6r32CzDW7Q45zhBGEWmgOcMMw
XIsRR7Y7nACH5v67K4fzqYFxIUWL4KHQJvYBCPtQPURNr7JI5o4eavT4CnAIkMM0pG/9aUr7Xk8p
VsVzpOxgmtDG1LdN3UR5tRegAQLlT/1RIy8+hhheQYu3Q13GitJuR/UNQHJbKhIiOYPfUXjjWSRn
kzCLU7YCsBggpNWBl9HgIdkF6EWBNS3uZiW4OWr4csQzTVGp1T9ERKk6OVnfvFPQtUD/CG6astPQ
lAXlPBWBFFdpHc/Im3jUDECQi/FOmm8mOaUQQgSpr2gKHELu6X5aXPMw37stDNhJoInFfXaHGeZ3
cBjTY/janjfIZLgJca8v29WOt5/x0Nqxrz8iEioMOTFIMCMGCSqGSIb3DQEJFDEWHhQAcAByAGkA
dgBhAHQAZQBrAGUAeTAhBgkqhkiG9w0BCRUxFAQSVGltZSAxMzg2MTMwNTk1NzEwMIIDMwYJKoZI
hvcNAQcGoIIDJDCCAyACAQAwggMZBgkqhkiG9w0BBwEwKAYKKoZIhvcNAQwBBjAaBBTway8VQW9b
3WNheH9QKUMvJjJNQQICBACAggLgvy0sCErDHySAqGw0NJ4wYDg699xrSS6O343GBfD0bTT9+Pma
JvnnaLJPp0VAvg9o3V8c8yUJ06smAT488fonGCxZN46fBuCEv/aIgIEwwlsW/WD2hDyMloJ9SaCp
uXfT7y3GcTGGYDXfzmFUewaaO5CMNYT07v2euVEoFztYDyRFYeb0XMlLDksCfXInd0phB4XyH/bk
iHR5LDf/8LBHsqXOPTC0E+tSM+LLDQ4etFvXm3y2BiEIVYhIG+jXrwsh5nw3xF7jecM03H4MStI2
f8lhJLCPZHb5lM60V2ErFi/n7AynpnTKrC5OFj586G0ZaupdpxLiJnJrv9r5p7hg2tK+cpSqQ73f
/ytFTMQMXAHMgs8SBkymchpUSXrDQIhz89EwTsa1vgJXSET+1j6QX2QnAYXXqkGa/K1+p5EqBXtP
hzMzUsvFZ0qRWgGToJoMjrmNZw1JK9oBC5NQCTFXU+A29L3BDhb89mxb05rooHCOCjYGCm2Sswt2
8Zn5u3Uok7reZUpva8LXDmUh8Ms1Fv233vG7f6QYi6IKTAOYQnXkcUtAh/dNdCEErzEiiUS+4EUQ
ACTC1LCEwYhiYoQEXOwa7y5omhUML+peB8v/3NiD3MpNRESrBwMk4Cypz7DKNJIElLWyCFQ/Pud5
UVP5Qs5g8iGV4c4vmlSAt5f5WzxcOYIQjJBMYkRwhbJQ0vKbcivfj87Q+3Ck9L8Loo55j2NBjXMD
T8l1aLtyVWNsh2qoiMJI4iEG+T45aGNtpBMm1ZUKPcSoT01cOko0i2qg1pYxq2TR/Pd3M/QVrc9v
aCX24RQ3HLQLD12CfkxqJT5xoLIBjfrK3JRVlvOsz3oqn/RFLMbdCkxvsXfky73vyd9M5OPcd+Or
x2mJy6S+btcgmg4BL4ad6MfjnTmMiUZbsOUwC4OaQUr1bvFFvxBh3EpGhRoQEEkQzXs4T2QHobo3
5/xJBhHENVpoR8DCAx+IeDA9MCEwCQYFKw4DAhoFAAQUvhdMKv5FVt0pQ5wWkSLsaOzyMyoEFLWR
0kqCkhaWG3YxCRc1s194ffq4AgIEAA==</urn:serviceAccountPKCSContent>
	<urn:commentId>AAAAAHoelTY</urn:commentId>
   </soapenv:Body>
</soapenv:Envelope>